#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/spanda-eks/kubernetes-ops-staging-helm-ingress-nginx/runs/run-EGw8FKRE1rzMoADz

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.ingress-nginx-external.helm_release.helm_chart: Refreshing state... [id=ingress-nginx-external]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ingress-nginx-external.helm_release.helm_chart will be updated in-place
  ~ resource "helm_release" "helm_chart" {
        id                         = "ingress-nginx-external"
        name                       = "ingress-nginx-external"
      ~ values                     = [
          - <<-EOT
                controller:
                  ingressClass: nginx-external
                  
                  replicaCount: 2
                
                
                  service:
                    enabled: true
                
                    annotations:
                      service.beta.kubernetes.io/aws-load-balancer-connection-idle-timeout: "60"
                
                  nodeSelectors: {}
                
                  tolerations: []
                
                # Istio changes to not add the istio sidecar to the prometheus operator's addmission webhook patch
                # https://github.com/prometheus-community/helm-charts/issues/479#issuecomment-752709725
                  admissionWebhooks:
                    annotations:
                      sidecar.istio.io/inject: "false"
            EOT,
          + <<-EOT
                controller:
                  ingressClass: nginx-external
                  
                  replicaCount: 1
                
                
                  service:
                    enabled: true
                
                    annotations:
                      service.beta.kubernetes.io/aws-load-balancer-connection-idle-timeout: "60"
                
                  nodeSelectors: {}
                
                  tolerations: []
                
                # Istio changes to not add the istio sidecar to the prometheus operator's addmission webhook patch
                # https://github.com/prometheus-community/helm-charts/issues/479#issuecomment-752709725
                  admissionWebhooks:
                    annotations:
                      sidecar.istio.io/inject: "false"
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # module.ingress-nginx-external-new.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx-external-new"
      + namespace                  = "ingress-nginx"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                controller:
                  ingressClass: nginx-external-new
                  
                  replicaCount: 1
                
                
                  service:
                    enabled: true
                
                    annotations:
                      service.beta.kubernetes.io/aws-load-balancer-connection-idle-timeout: "60"
                
                  nodeSelectors: {}
                
                  tolerations: []
                
                # Istio changes to not add the istio sidecar to the prometheus operator's addmission webhook patch
                # https://github.com/prometheus-community/helm-charts/issues/479#issuecomment-752709725
                  admissionWebhooks:
                    annotations:
                      sidecar.istio.io/inject: "false"
            EOT,
        ]
      + verify                     = false
      + version                    = "3.30.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 1 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```


</details>

*Pusher: @shubhasish, Action: `pull_request`*